       01  EPSPDÅÄÖ.
      * INPUT
           03 EPSPDÅÄÖ-PRINCIPLE-DATA   PIC S9(9)V99 COMP.
           03 EPSPDÅÄÖ-NUMBER-OF-YEARS  PIC S9(4)    COMP.
           03 EPSPDÅÄÖ-NUMBER-OF-MONTHS PIC S9(4)    COMP.
           03 EPSPDÅÄÖ-QUOTED-INTEREST-RATE
                                        PIC S9(2)v9(3) COMP.
           03 EPSPDÅÄÖ-YEAR-MONTH-IND   PIC X.
      * OUTPUT
           03 EPSPDÅÄÖ-RETURN-MONTH-PAYMENT
                                        PIC S9(7)V99 COMP.
           03 EPSPDÅÄÖ-RETURN-ERROR     PIC X(80).

